---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException
source: html/760a502f-2a1c-6fa9-3820-ddafc76ff779.htm
---
# RevitServerModelNameBreaksConventionException Members

Retrieves data needed to serialize the target object.